Revit 2027 API
DisplacementElement.GetDisplacementElementIds Method
 The element ids of all DisplacementElements owned by the specified view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetDisplacementElementIds(
	View view
)
Public Shared Function GetDisplacementElementIds (
	view As View
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetDisplacementElementIds(
	View^ view
)
static member GetDisplacementElementIds :
        view : View -> ICollection<ElementId>
Parameters
view View
 The view.
Return Value
ICollection<ElementId>
 The element ids.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace